

#ifndef IO_H
#define IO_H
#include <iostream>
#include <fstream>
#include <string>
#include <vector>
#include "IO.h"

/*
Задача 1
Дефинирайте функция за отваряне на файл за писане, която приема ifstream и го връща като референция.
Функцията трябва да може да работи и с потоци в невалидно състояние(трябва да се погрижи да направи
състоянието валидно в случай че не е)
*/
std::ofstream& fileOpenForWritting(std::ofstream& outFile, std::string fileName);

/*
Задача 2
Дефинирайте функция за отваряне на файл за четене, която приема ofstream и го връща като референция. Функцията трябва
да приема и параметър за режима на отваряне на файла, който да има и подходяща default стойност.
*/
std::ifstream& fileOpenForReading(std::ifstream& intFile, std::string fileName, std::ios::openmode mode);

/*
Задача 3
Напишете функция, която приема име на файл, който да отвори и от който да чете.Функцията трябва да прочита всички думи
от файла и да ги записва в обратен ред във втори файл, който има името на първия, но с “_reverse” в името.
*/
void reverseFileContent(std::string fileName);

/*
Задача 4
Напишете функция, която прави същото като функцията от предходната задача, но с множество файлове (функцията трябва
да приема контейнер с имена на файлове, от които да чете)
*/
void reverseFilesContent(const std::vector<std::string>& fileNames);

/*
Задача 5
Напишете функция, която чете от istream цели числа и принтира най-голямото, най-малкото и средното
аритметично от/на всички прочетени числа
*/
void readNumbers(std::istream& in);

/*
Задача 6
Напишете функция, подобна на тази от предходната задача, но да работи с floating-point числа и да принтира
резултата в колони от по 8 символа, подравнени отдясно, с точност - до 3 цифри след десетичната запетая
*/
void readNumbersFloat(std::istream& in);


#endif
