#ifndef SEQUENTIAL_H
#define SEQUENTIAL_H

/*
Задача 1
Напишете програма, която моли потребителя да въвежда в обратен ред цели числа във vector.
Принтирайте съдържанието на контейнера.
*/
void task1(void);
/*
Задача 2
Напишете функция, която приема deque от int числа и премахва всички нечетни числа от контейнера.
*/
void task2(void);

/*
Задача 3
Напишете програма, която моли потребителя да въведе цели числа във vector, след което принтира всички уникални
елементи на контейнера
*/
void task3(void);

/*
Задача 4
Напишете програма, която моли потребителя да въведе цели числа във list, след което, премахва всички дублиращи се
елементи и го принтира в обратен ред.
*/
void task4(void);

/*
Задача 5
Напишете програма, която моли потребителя да въведе текст на няколко реда(до прочитане на EOF), след което прави
всички думи от текста да започват с главна буква и принтира текста отзад - напред(целия текст отзад - напред, не по редове)
Задачи за самподготовка
*/
void task5(void);

#endif
