/* 
Дефинирайте променливи със стойност: 
4.9876543, 
7.123456789012345678890, 
18 398 458 438 583 853.28, 
18 398 458 438 583 853.39875937284928422.
Изведете всяка променлива на екрана с printf() 
*/

#include <stdio.h>

int main()
{
	double d1 = 4.9876543;
	double d2 = 7.123456789012345678890;
	long double d3 = 18398458438583853.28;
	long double d4 = 18398458438583853.39875937284928422;

	printf("\n%.7lf", d1);
	printf("\n%.21lf", d2);
	printf("\n%.2lf", d3);
	printf("\n%.20lf", d4);

	return 0;
}