/*
● Дефинирайте променлива с име age от тип int в глобалния namespace и я инициялизирайте с начална стойност: 1.
● Дефинирайте namespace ca. В него дефинирайте друга глобална променлива с име age, тип int и начална стойност: 2.
● Дефинирайте вложен в namespace ca, втори namespace cpp (т.е ca::cpp).В него дефинирайте трета глобална променлива
от тип int, с име age и начална стойност 3.
● В ca::cpp дефинирайте struct Person с public data member - age от тип int. Дефинирайте default constructor на типа Person,
който инициализира age data member’a си на 4.
● Дефинирайте и последна, локална променлива от тип int с име - age в тялото на конструктора и я инициализирайте със
стойност: 5
● В тялото на конструктора изпринтете “54321”, използвайки единствено int променливите с име age, без да им променяте
началните стойности (достъпете всяка от петте променливи age в тялото на конструктора)
*/

#ifndef _4_1_DEFINE_H
#define _4_1_DEFINE_H

int age = 1;

namespace CA
{
	int age = 2;
	namespace CPP
	{
		int age = 3;
		struct Person
		{
		public:
			Person();
			int age;
		};
	}
}

#endif