/*
● Дефинирайте масив 3x3 от int.
int arr[3][3] = {1, 2, 3, 4, 5, 6, 7, 8, 9};
● Дефинирайте променлива от тип указател към масив с три int елемента:
int(*arrPtr)[3]
● Принтирайте първата колона на масива(първия елемент на всеки ред от масива). За целта
обходете масива с указателя(указател към редове) и адресна ариритметика, без да ползвате
индексиране - [] или целочислени променливи.
*/

#include <stdio.h>
int main(void)
{
	int arr[3][3] = { 1, 2, 3, 4, 5, 6, 7, 8, 9 };
	int(*arrPtr)[3];
	arrPtr = &(*arr);
	int countElements = (int)sizeof(arr[3]) / (int)sizeof(int);
	for (; arrPtr < &(*arr) + countElements; arrPtr++)
	{
		printf("\n%d", **arrPtr);
	}
	return 0;
}