/*
Да променим програмата така че да поддържа различни менюта и опции за различните видове потребители:
● Потребител от тип Owner ще може всичко
● Потребител от тип Admin ще може всичко като Owner, без да може да добавя/премахва фирмени ПС, 
както и да редактира информация замарка/модел
● Потребител от тип User ще може само да резервира и да отлага резервация.
Дефинирайте enum константи за различните възможности, които ще предлага приложението, в зависимост 
от типа на потредбителя
enum E_APP_PERMISSION_FLAGS
{
 E_BOOK_VEHICLE = //..
 E_UNBOOK_VEHICLE = //..,
 E_EDIT_VEHICLE_INFO = //..,
 E_ADD_REMOVE_VEHICLE = //..,
 E_EDIT_BRAND_INFO = //..
};
Използвайте такива стойности за константите, че да можем да ги ползваме като маски/флагове - всяка константа 
трябва да има 0 на всяка позиция,освен на позиция, която е уникална за константата ( пример побитов запис 
на четири различни константи: 0001, 0010, 0100, 1000 )
За да напишете стойностите на константите използвайте или оператор <<, или целочислени бинарни литерали
*/


enum E_APP_PERMISSION_FLAGS
{
	E_BOOK_VEHICLE = 1;
	E_UNBOOK_VEHICLE = 1 << 1;
	E_EDIT_VEHICLE_INFO = 1 << 2;
	E_ADD_REMOVE_VEHICLE = 1 << 3;
	E_EDIT_BRAND_INFO = 1 << 4;
};

enum E_APP_USER_FLAGS
{
	OWNER = 0b11111;
	ADMIN = 0b11100;
	USER = 0b00011;
};